app/views/avisosms/_send_sms_text.html.erb

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
 <soap:Body>
  <SendTextMessage xmlns="http://sms.avisosms.ru/gate.php">
  <smsUser><%= Rails.configuration.avisosms[:username]%></smsUser>
    <password><%= Rails.configuration.avisosms[:password]%></password>
    <destinationAddress><%= sms[:destinationAddress] %></destinationAddress>
    <messageData><%= sms[:messageData] %></messageData>
    <sourceAddress><%= sms[:sourceAddress] %></sourceAddress>
    <deliveryReport>1</deliveryReport>
    <flashMessage>0</flashMessage>
    <validityPeriod>10</validityPeriod>
  </SendTextMessage>
 </soap:Body>
</soap:Envelope>
